# Домашнее задание

# Задание 1

1. Скачайте датасет любого размера с сайта [GroupLens](https://grouplens.org/datasets/movielens/).
2. Определите, какому фильму было выставлено больше всего оценок 5.0.

**Примечание:** Для анализа данных вы можете использовать библиотеки pandas и numpy. Датасет может состоять из нескольких файлов. Обычно оценки и названия фильмов хранятся в разных файлах, поэтому может потребоваться объединить данные для полного анализа.

Ваша задача – найти фильм с наибольшим количеством оценок 5.0. Удачи!

In [4]:
import pandas as pd

# Читаем все необходимые файлы
movies = pd.read_csv('movies.csv')
tags = pd.read_csv('tags.csv')
rating = pd.read_csv('ratings.csv')
links = pd.read_csv('links.csv')
power = pd.read_csv('power.csv')

In [9]:
rating.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [61]:
# Отбираем только строки, где рейтинг равен 5.0
high_rating_df = ratings_df[ratings_df['rating'] == 5.0]

# Находим фильм с максимальным количеством высоких оценок
top_rated_movie_id = high_rating_df['movieId'].value_counts().idxmax()

# Используем movies_df, чтобы получить название фильма по movieId
top_rated_movie = movies_df[movies_df['movieId'] == top_rated_movie_id]['title'].values[0]

top_rated_movietop_rated_movie

# Задание 2

По данным файла power.csv (находится в архиве в разделе Материалы к лекции «Библиотека Pandas» - файл “Дополнительные файлы для домашнего задания”) посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 год. Не учитывайте в расчётах отрицательные значения quantity.

In [63]:
power.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [42]:
# Определяем нужные страны и категории
countries = ['Latvia', 'Lithuania', 'Estonia']
categories = [4, 12, 21]

# Фильтруем данные
filtered_data = power[
    (power['country'].isin(countries)) &
    (power['category'].isin(categories)) &
    (power['year'].between(2005, 2010)) &
    (power['quantity'] > 0)
]

# Вычисляем сумму
total_consumption = filtered_data['quantity'].sum()
total_consumption

quantity    240580.0
dtype: object

# Задание 3



1. Выберите страницу любого сайта с табличными данными. В качестве примера можете использовать следующие страницы:

    - [ForTrader](https://fortrader.org/quotes)
    - [PythonWorld](https://pythonworld.ru/tipy-dannyx-v-python/stroki-funkcii-i-metody-strok.html)
    

2. Импортируйте таблицы с этой страницы в pandas DataFrame.

In [59]:
pd.read_html('https://fortrader.org/quotes')[2]

                           Название   Цена  Изменение  Изменение(%)  Обновлено
0       Золото Цена золота на бирже  1 812       -1.0         -0.00        NaN
1  Серебро Цена на серебро на бирже  25.65       -0.0         -0.00        NaN
2         Палладий Цена на Палладий  2 624       -7.0         -0.00        NaN
3           Платина Цены на платину  1 100       -0.0         -0.00        NaN
4           Медь Цена меди на бирже   4.31       -0.0         -0.01        NaN

In [65]:
readhtml = 'https://fortrader.org/quotes'

df = pd.read_html(readhtml)
df[2]

                           Название   Цена  Изменение  Изменение(%)  Обновлено
0       Золото Цена золота на бирже  1 812       -1.0         -0.00        NaN
1  Серебро Цена на серебро на бирже  25.65       -0.0         -0.00        NaN
2         Палладий Цена на Палладий  2 624       -7.0         -0.00        NaN
3           Платина Цены на платину  1 100       -0.0         -0.00        NaN
4           Медь Цена меди на бирже   4.31       -0.0         -0.01        NaN